7767517
117 135
Input                    input.1                  0 1 input.1
Convolution              Conv_0                   1 1 input.1 384 0=32 1=3 3=2 4=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_5                   1 1 384 389 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_10                  1 1 389 391 0=16 1=1 5=1 6=512
Convolution              Conv_12                  1 1 391 396 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_17                  1 1 396 401 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_22                  1 1 401 403 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 403 403_splitncnn_0 403_splitncnn_1
Convolution              Conv_24                  1 1 403_splitncnn_1 408 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_29                  1 1 408 413 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_34                  1 1 413 415 0=24 1=1 5=1 6=3456
BinaryOp                 Add_36                   2 1 415 403_splitncnn_0 416
Convolution              Conv_37                  1 1 416 421 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_42                  1 1 421 426 0=144 1=5 3=2 4=2 5=1 6=3600 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_47                  1 1 426 428 0=40 1=1 5=1 6=5760
Split                    splitncnn_1              1 2 428 428_splitncnn_0 428_splitncnn_1
Convolution              Conv_49                  1 1 428_splitncnn_1 433 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_54                  1 1 433 438 0=240 1=5 4=2 5=1 6=6000 7=240 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_59                  1 1 438 440 0=40 1=1 5=1 6=9600
BinaryOp                 Add_61                   2 1 440 428_splitncnn_0 441
Split                    splitncnn_2              1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution              Conv_62                  1 1 441_splitncnn_1 446 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_67                  1 1 446 451 0=240 1=3 3=2 4=1 5=1 6=2160 7=240 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_72                  1 1 451 453 0=80 1=1 5=1 6=19200
Split                    splitncnn_3              1 2 453 453_splitncnn_0 453_splitncnn_1
Convolution              Conv_74                  1 1 453_splitncnn_1 458 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_79                  1 1 458 463 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_84                  1 1 463 465 0=80 1=1 5=1 6=38400
BinaryOp                 Add_86                   2 1 465 453_splitncnn_0 466
Split                    splitncnn_4              1 2 466 466_splitncnn_0 466_splitncnn_1
Convolution              Conv_87                  1 1 466_splitncnn_1 471 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_92                  1 1 471 476 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_97                  1 1 476 478 0=80 1=1 5=1 6=38400
BinaryOp                 Add_99                   2 1 478 466_splitncnn_0 479
Convolution              Conv_100                 1 1 479 484 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_105                 1 1 484 489 0=480 1=5 4=2 5=1 6=12000 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_110                 1 1 489 491 0=112 1=1 5=1 6=53760
Split                    splitncnn_5              1 2 491 491_splitncnn_0 491_splitncnn_1
Convolution              Conv_112                 1 1 491_splitncnn_1 496 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_117                 1 1 496 501 0=672 1=5 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_122                 1 1 501 503 0=112 1=1 5=1 6=75264
BinaryOp                 Add_124                  2 1 503 491_splitncnn_0 504
Split                    splitncnn_6              1 2 504 504_splitncnn_0 504_splitncnn_1
Convolution              Conv_125                 1 1 504_splitncnn_1 509 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_130                 1 1 509 514 0=672 1=5 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_135                 1 1 514 516 0=112 1=1 5=1 6=75264
BinaryOp                 Add_137                  2 1 516 504_splitncnn_0 517
Split                    splitncnn_7              1 2 517 517_splitncnn_0 517_splitncnn_1
Convolution              Conv_138                 1 1 517_splitncnn_1 522 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_143                 1 1 522 527 0=672 1=5 3=2 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_148                 1 1 527 529 0=192 1=1 5=1 6=129024
Split                    splitncnn_8              1 2 529 529_splitncnn_0 529_splitncnn_1
Convolution              Conv_150                 1 1 529_splitncnn_1 534 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_155                 1 1 534 539 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_160                 1 1 539 541 0=192 1=1 5=1 6=221184
BinaryOp                 Add_162                  2 1 541 529_splitncnn_0 542
Split                    splitncnn_9              1 2 542 542_splitncnn_0 542_splitncnn_1
Convolution              Conv_163                 1 1 542_splitncnn_1 547 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_168                 1 1 547 552 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_173                 1 1 552 554 0=192 1=1 5=1 6=221184
BinaryOp                 Add_175                  2 1 554 542_splitncnn_0 555
Split                    splitncnn_10             1 2 555 555_splitncnn_0 555_splitncnn_1
Convolution              Conv_176                 1 1 555_splitncnn_1 560 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_181                 1 1 560 565 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_186                 1 1 565 567 0=192 1=1 5=1 6=221184
BinaryOp                 Add_188                  2 1 567 555_splitncnn_0 568
Convolution              Conv_189                 1 1 568 573 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_194                 1 1 573 578 0=1152 1=3 4=1 5=1 6=10368 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_199                 1 1 578 580 0=320 1=1 5=1 6=368640
Convolution              Conv_201                 1 1 441_splitncnn_0 581 0=96 1=1 5=1 6=3840
Convolution              Conv_202                 1 1 517_splitncnn_0 582 0=96 1=1 5=1 6=10752
Convolution              Conv_203                 1 1 580 583 0=96 1=1 5=1 6=30720
Split                    splitncnn_11             1 2 583 583_splitncnn_0 583_splitncnn_1
Interp                   Resize_222               1 1 583_splitncnn_1 602 0=2 1=2.0 2=2.0
BinaryOp                 Add_223                  2 1 582 602 603
Split                    splitncnn_12             1 2 603 603_splitncnn_0 603_splitncnn_1
Interp                   Resize_242               1 1 603_splitncnn_1 622 0=2 1=2.0 2=2.0
BinaryOp                 Add_243                  2 1 581 622 623
Split                    splitncnn_13             1 2 623 623_splitncnn_0 623_splitncnn_1
Interp                   Resize_262               1 1 623_splitncnn_1 642 0=2 1=0.5 2=0.5
BinaryOp                 Add_263                  2 1 603_splitncnn_0 642 643
Split                    splitncnn_14             1 2 643 643_splitncnn_0 643_splitncnn_1
Interp                   Resize_282               1 1 643_splitncnn_1 662 0=2 1=0.5 2=0.5
BinaryOp                 Add_283                  2 1 583_splitncnn_0 662 663
ConvolutionDepthWise     Conv_284                 1 1 623_splitncnn_0 668 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_289                 1 1 668 673 0=96 1=1 5=1 6=9216 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_294                 1 1 673 678 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_299                 1 1 678 683 0=96 1=1 5=1 6=9216 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_304                 1 1 683 684 0=112 1=1 5=1 6=10752
Slice                    Split_305                1 2 684 685 686 -23300=2,80,-233
Sigmoid                  Sigmoid_306              1 1 685 687
Reshape                  Reshape_308              1 1 687 689 0=-1 1=80
Permute                  Transpose_309            1 1 689 cls_pred_stride_8 0=1
Reshape                  Reshape_311              1 1 686 692 0=-1 1=32
Permute                  Transpose_312            1 1 692 dis_pred_stride_8 0=1
ConvolutionDepthWise     Conv_313                 1 1 643_splitncnn_0 698 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_318                 1 1 698 703 0=96 1=1 5=1 6=9216 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_323                 1 1 703 708 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_328                 1 1 708 713 0=96 1=1 5=1 6=9216 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_333                 1 1 713 714 0=112 1=1 5=1 6=10752
Slice                    Split_334                1 2 714 715 716 -23300=2,80,-233
Sigmoid                  Sigmoid_335              1 1 715 717
Reshape                  Reshape_337              1 1 717 719 0=-1 1=80
Permute                  Transpose_338            1 1 719 cls_pred_stride_16 0=1
Reshape                  Reshape_340              1 1 716 722 0=-1 1=32
Permute                  Transpose_341            1 1 722 dis_pred_stride_16 0=1
ConvolutionDepthWise     Conv_342                 1 1 663 728 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_347                 1 1 728 733 0=96 1=1 5=1 6=9216 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_352                 1 1 733 738 0=96 1=3 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_357                 1 1 738 743 0=96 1=1 5=1 6=9216 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_362                 1 1 743 744 0=112 1=1 5=1 6=10752
Slice                    Split_363                1 2 744 745 746 -23300=2,80,-233
Sigmoid                  Sigmoid_364              1 1 745 747
Reshape                  Reshape_366              1 1 747 749 0=-1 1=80
Permute                  Transpose_367            1 1 749 cls_pred_stride_32 0=1
Reshape                  Reshape_369              1 1 746 752 0=-1 1=32
Permute                  Transpose_370            1 1 752 dis_pred_stride_32 0=1
