7767517
148 171
Input                    input.1                  0 1 input.1
Convolution              Conv_0                   1 1 input.1 510 0=32 1=3 3=2 4=1 5=1 6=864 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_5                   1 1 510 515 0=32 1=3 4=1 5=1 6=288 7=32 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_10                  1 1 515 517 0=16 1=1 5=1 6=512
Convolution              Conv_12                  1 1 517 522 0=96 1=1 5=1 6=1536 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_17                  1 1 522 527 0=96 1=3 3=2 4=1 5=1 6=864 7=96 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_22                  1 1 527 529 0=24 1=1 5=1 6=2304
Split                    splitncnn_0              1 2 529 529_splitncnn_0 529_splitncnn_1
Convolution              Conv_24                  1 1 529_splitncnn_1 534 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_29                  1 1 534 539 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_34                  1 1 539 541 0=24 1=1 5=1 6=3456
BinaryOp                 Add_36                   2 1 541 529_splitncnn_0 542
Split                    splitncnn_1              1 2 542 542_splitncnn_0 542_splitncnn_1
Convolution              Conv_37                  1 1 542_splitncnn_1 547 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_42                  1 1 547 552 0=144 1=3 4=1 5=1 6=1296 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_47                  1 1 552 554 0=24 1=1 5=1 6=3456
BinaryOp                 Add_49                   2 1 554 542_splitncnn_0 555
Convolution              Conv_50                  1 1 555 560 0=144 1=1 5=1 6=3456 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_55                  1 1 560 565 0=144 1=5 3=2 4=2 5=1 6=3600 7=144 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_60                  1 1 565 567 0=40 1=1 5=1 6=5760
Split                    splitncnn_2              1 2 567 567_splitncnn_0 567_splitncnn_1
Convolution              Conv_62                  1 1 567_splitncnn_1 572 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_67                  1 1 572 577 0=240 1=5 4=2 5=1 6=6000 7=240 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_72                  1 1 577 579 0=40 1=1 5=1 6=9600
BinaryOp                 Add_74                   2 1 579 567_splitncnn_0 580
Split                    splitncnn_3              1 2 580 580_splitncnn_0 580_splitncnn_1
Convolution              Conv_75                  1 1 580_splitncnn_1 585 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_80                  1 1 585 590 0=240 1=5 4=2 5=1 6=6000 7=240 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_85                  1 1 590 592 0=40 1=1 5=1 6=9600
BinaryOp                 Add_87                   2 1 592 580_splitncnn_0 593
Split                    splitncnn_4              1 2 593 593_splitncnn_0 593_splitncnn_1
Convolution              Conv_88                  1 1 593_splitncnn_1 598 0=240 1=1 5=1 6=9600 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_93                  1 1 598 603 0=240 1=3 3=2 4=1 5=1 6=2160 7=240 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_98                  1 1 603 605 0=80 1=1 5=1 6=19200
Split                    splitncnn_5              1 2 605 605_splitncnn_0 605_splitncnn_1
Convolution              Conv_100                 1 1 605_splitncnn_1 610 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_105                 1 1 610 615 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_110                 1 1 615 617 0=80 1=1 5=1 6=38400
BinaryOp                 Add_112                  2 1 617 605_splitncnn_0 618
Split                    splitncnn_6              1 2 618 618_splitncnn_0 618_splitncnn_1
Convolution              Conv_113                 1 1 618_splitncnn_1 623 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_118                 1 1 623 628 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_123                 1 1 628 630 0=80 1=1 5=1 6=38400
BinaryOp                 Add_125                  2 1 630 618_splitncnn_0 631
Split                    splitncnn_7              1 2 631 631_splitncnn_0 631_splitncnn_1
Convolution              Conv_126                 1 1 631_splitncnn_1 636 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_131                 1 1 636 641 0=480 1=3 4=1 5=1 6=4320 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_136                 1 1 641 643 0=80 1=1 5=1 6=38400
BinaryOp                 Add_138                  2 1 643 631_splitncnn_0 644
Convolution              Conv_139                 1 1 644 649 0=480 1=1 5=1 6=38400 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_144                 1 1 649 654 0=480 1=5 4=2 5=1 6=12000 7=480 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_149                 1 1 654 656 0=112 1=1 5=1 6=53760
Split                    splitncnn_8              1 2 656 656_splitncnn_0 656_splitncnn_1
Convolution              Conv_151                 1 1 656_splitncnn_1 661 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_156                 1 1 661 666 0=672 1=5 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_161                 1 1 666 668 0=112 1=1 5=1 6=75264
BinaryOp                 Add_163                  2 1 668 656_splitncnn_0 669
Split                    splitncnn_9              1 2 669 669_splitncnn_0 669_splitncnn_1
Convolution              Conv_164                 1 1 669_splitncnn_1 674 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_169                 1 1 674 679 0=672 1=5 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_174                 1 1 679 681 0=112 1=1 5=1 6=75264
BinaryOp                 Add_176                  2 1 681 669_splitncnn_0 682
Split                    splitncnn_10             1 2 682 682_splitncnn_0 682_splitncnn_1
Convolution              Conv_177                 1 1 682_splitncnn_1 687 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_182                 1 1 687 692 0=672 1=5 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_187                 1 1 692 694 0=112 1=1 5=1 6=75264
BinaryOp                 Add_189                  2 1 694 682_splitncnn_0 695
Split                    splitncnn_11             1 2 695 695_splitncnn_0 695_splitncnn_1
Convolution              Conv_190                 1 1 695_splitncnn_1 700 0=672 1=1 5=1 6=75264 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_195                 1 1 700 705 0=672 1=5 3=2 4=2 5=1 6=16800 7=672 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_200                 1 1 705 707 0=192 1=1 5=1 6=129024
Split                    splitncnn_12             1 2 707 707_splitncnn_0 707_splitncnn_1
Convolution              Conv_202                 1 1 707_splitncnn_1 712 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_207                 1 1 712 717 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_212                 1 1 717 719 0=192 1=1 5=1 6=221184
BinaryOp                 Add_214                  2 1 719 707_splitncnn_0 720
Split                    splitncnn_13             1 2 720 720_splitncnn_0 720_splitncnn_1
Convolution              Conv_215                 1 1 720_splitncnn_1 725 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_220                 1 1 725 730 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_225                 1 1 730 732 0=192 1=1 5=1 6=221184
BinaryOp                 Add_227                  2 1 732 720_splitncnn_0 733
Split                    splitncnn_14             1 2 733 733_splitncnn_0 733_splitncnn_1
Convolution              Conv_228                 1 1 733_splitncnn_1 738 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_233                 1 1 738 743 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_238                 1 1 743 745 0=192 1=1 5=1 6=221184
BinaryOp                 Add_240                  2 1 745 733_splitncnn_0 746
Split                    splitncnn_15             1 2 746 746_splitncnn_0 746_splitncnn_1
Convolution              Conv_241                 1 1 746_splitncnn_1 751 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_246                 1 1 751 756 0=1152 1=5 4=2 5=1 6=28800 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_251                 1 1 756 758 0=192 1=1 5=1 6=221184
BinaryOp                 Add_253                  2 1 758 746_splitncnn_0 759
Convolution              Conv_254                 1 1 759 764 0=1152 1=1 5=1 6=221184 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_259                 1 1 764 769 0=1152 1=3 4=1 5=1 6=10368 7=1152 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_264                 1 1 769 771 0=320 1=1 5=1 6=368640
Convolution              Conv_266                 1 1 593_splitncnn_0 772 0=128 1=1 5=1 6=5120
Convolution              Conv_267                 1 1 695_splitncnn_0 773 0=128 1=1 5=1 6=14336
Convolution              Conv_268                 1 1 771 774 0=128 1=1 5=1 6=40960
Split                    splitncnn_16             1 2 774 774_splitncnn_0 774_splitncnn_1
Interp                   Resize_287               1 1 774_splitncnn_1 793 0=2 1=2.0 2=2.0
BinaryOp                 Add_288                  2 1 773 793 794
Split                    splitncnn_17             1 2 794 794_splitncnn_0 794_splitncnn_1
Interp                   Resize_307               1 1 794_splitncnn_1 813 0=2 1=2.0 2=2.0
BinaryOp                 Add_308                  2 1 772 813 814
Split                    splitncnn_18             1 2 814 814_splitncnn_0 814_splitncnn_1
Interp                   Resize_327               1 1 814_splitncnn_1 833 0=2 1=0.5 2=0.5
BinaryOp                 Add_328                  2 1 794_splitncnn_0 833 834
Split                    splitncnn_19             1 2 834 834_splitncnn_0 834_splitncnn_1
Interp                   Resize_347               1 1 834_splitncnn_1 853 0=2 1=0.5 2=0.5
BinaryOp                 Add_348                  2 1 774_splitncnn_0 853 854
ConvolutionDepthWise     Conv_349                 1 1 814_splitncnn_0 859 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_354                 1 1 859 864 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_359                 1 1 864 869 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_364                 1 1 869 874 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_369                 1 1 874 879 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_374                 1 1 879 884 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_379                 1 1 884 885 0=124 1=1 5=1 6=15872
Slice                    Split_380                1 2 885 886 887 -23300=2,80,-233
Sigmoid                  Sigmoid_381              1 1 886 888
Reshape                  Reshape_383              1 1 888 890 0=-1 1=80
Permute                  Transpose_384            1 1 890 cls_pred_stride_8 0=1
Reshape                  Reshape_386              1 1 887 893 0=-1 1=44
Permute                  Transpose_387            1 1 893 dis_pred_stride_8 0=1
ConvolutionDepthWise     Conv_388                 1 1 834_splitncnn_0 899 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_393                 1 1 899 904 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_398                 1 1 904 909 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_403                 1 1 909 914 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_408                 1 1 914 919 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_413                 1 1 919 924 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_418                 1 1 924 925 0=124 1=1 5=1 6=15872
Slice                    Split_419                1 2 925 926 927 -23300=2,80,-233
Sigmoid                  Sigmoid_420              1 1 926 928
Reshape                  Reshape_422              1 1 928 930 0=-1 1=80
Permute                  Transpose_423            1 1 930 cls_pred_stride_16 0=1
Reshape                  Reshape_425              1 1 927 933 0=-1 1=44
Permute                  Transpose_426            1 1 933 dis_pred_stride_16 0=1
ConvolutionDepthWise     Conv_427                 1 1 854 939 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_432                 1 1 939 944 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_437                 1 1 944 949 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_442                 1 1 949 954 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
ConvolutionDepthWise     Conv_447                 1 1 954 959 0=128 1=3 4=1 5=1 6=1152 7=128 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_452                 1 1 959 964 0=128 1=1 5=1 6=16384 9=3 -23310=2,0.000000e+00,6.000000e+00
Convolution              Conv_457                 1 1 964 965 0=124 1=1 5=1 6=15872
Slice                    Split_458                1 2 965 966 967 -23300=2,80,-233
Sigmoid                  Sigmoid_459              1 1 966 968
Reshape                  Reshape_461              1 1 968 970 0=-1 1=80
Permute                  Transpose_462            1 1 970 cls_pred_stride_32 0=1
Reshape                  Reshape_464              1 1 967 973 0=-1 1=44
Permute                  Transpose_465            1 1 973 dis_pred_stride_32 0=1
